#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьЗначенияРеквизитовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект); 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Документ.ЗаказКлиента.Провести");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьЗначенияРеквизитовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КСборке(Команда)
	
	Если Не Параметры.Ключ.Пустая() Тогда
		
		ОтключитьОбработчикОжидания("КСборкеНаКлиенте_ОбновитьСтатус");
		ПодключитьОбработчикОжидания("КСборкеНаКлиенте_ОбновитьСтатус", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КОтгрузке(Команда)
	
	Если Не Параметры.Ключ.Пустая() Тогда
		
		ОтключитьОбработчикОжидания("КОтгрузкеНаКлиенте_ОбновитьСтатус");
		ПодключитьОбработчикОжидания("КОтгрузкеНаКлиенте_ОбновитьСтатус", 1, Истина);
		
	КонецЕсли;;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СтатусПриИзмененииНаСервере(Ссылка, Статус)
	СтатусыДокументовВызовСервера.ОбновитьСтатусЗаказаКлиента(Ссылка, Статус);
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере(Параметры.Ключ, Статус);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЗначенияРеквизитовФормы()
	
	Если Не Параметры.Ключ.Пустая() Тогда
		Статус = СтатусыДокументовВызовСервера.СтатусЗаказаКлиента(Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КСборкеНаКлиенте_ОбновитьСтатус()
	КСборкеНаСервере_ОбновитьСтатус();	
КонецПроцедуры

&НаСервере
Процедура КСборкеНаСервере_ОбновитьСтатус()
	// Хдесь какие то контроли остатков перед сменой статуса и резерв фоном
	СтатусыДокументовВызовСервера.ОбновитьСтатусЗаказаКлиента(Объект.Ссылка, "КСборке");
	ОбновитьЗначенияРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры  

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиента.ОжидаетОформленияДокументов") Тогда
	
		ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект); 
		
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура КОтгрузкеНаКлиенте_ОбновитьСтатус()
	КОтгрузкеНаСервере_ОбновитьСтатус();	
КонецПроцедуры

&НаСервере
Процедура КОтгрузкеНаСервере_ОбновитьСтатус()
	// Хдесь какие то контроли остатков перед сменой статуса и резерв фоном
	СтатусыДокументовВызовСервера.ОбновитьСтатусЗаказаКлиента(Объект.Ссылка, "Отгрузить");
	ОбновитьЗначенияРеквизитовФормы();
КонецПроцедуры

#КонецОбласти


