#Область ПрограммныйИнтерфейс

Функция СтатусЗаказаКлиента(ЗаказКлиента) Экспорт

	Результат = Перечисления.СтатусыЗаказовКлиента.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыДокументов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|ГДЕ
	|	СтатусыДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = ВыборкаДетальныеЗаписи.Статус;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура ОбновитьСтатусЗаказаКлиента(ЗаказКлиента, НовыйСтатус) Экспорт
	
	Если ТипЗнч(НовыйСтатус) = Тип("Строка") Тогда	
		Статус = Перечисления.СтатусыЗаказовКлиента[НовыйСтатус];
	Иначе
		Статус = НовыйСтатус;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СтатусыДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = ЗаказКлиента;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

#КонецОбласти