Процедура ПодготовитьСообщение(Объект, СтруктураСообщенияДляОтправки, НастройкиОбменаСообщениями) Экспорт
	
	ПолноеИмя = Объект.Метаданные().ПолноеИмя();
	
	МенеджерОбъекта = ОбменСообщениямиСлужебный.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);	
	
	// Подготовка структуры перед преобразованием в JSON и помещением в ТекстСообщения
	
	// 1. Подготовим Реквизиты для отправки
	РеквизитыДляОтправки = Новый Структура();
	ПодготовитьРеквизитыОбъектаДляОтправки(МенеджерОбъекта, Объект, РеквизитыДляОтправки, ПолноеИмя);
	
	// 2. Делаем JSON
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, РеквизитыДляОтправки);
	ТелоJSON = ЗаписьJSON.Закрыть();
	
	СтруктураСообщенияДляОтправки.ТекстСообщения = ТелоJSON;

КонецПроцедуры 

Функция ШаблонСообщенияДляПреобразованияОбъектаВJSON() Экспорт
	
	Результат = Новый Структура();
	
	Результат.Вставить("ПолноеИмяОбъектаМетаданных");
	Результат.Вставить("Реквизиты");
	Результат.Вставить("Записи");
	Результат.Вставить("ДополнительнаяИнформация");	
	
	Возврат Результат;	
	
КонецФункции	

Процедура ПодготовитьРеквизитыОбъектаДляОтправки(МенеджерОбъекта, Объект, РеквизитыДляОтправки, ПолноеИмя)
	
    РеквизитыДляОтправки = МенеджерОбъекта.ДанныеОбъектаКВыгрузке(Объект);
		
КонецПроцедуры 



