
Процедура ЗарегистрироватьСообщениеДляОтправки(Объект) Экспорт
	
	ИспользуемыеВОбменеТипы = Справочники.НастройкиОбменаСообщениями.ИспользуемыеВОбменеТипы();
	
	ТипСтрокой = Метаданные.НайтиПоТипу(ТипЗнч(Объект)).ПолноеИмя();
	
	Если ИспользуемыеВОбменеТипы.Найти(ТипСтрокой) <> Неопределено Тогда
		Справочники.ИсходящиеСообщения.ЗарегистрироватьСообщениеДляОтправки(Объект);		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОтправкаСообщений() Экспорт
	
	Справочники.ИсходящиеСообщения.ОтправитьСообщения();	
		
КонецПроцедуры

Процедура ПолучениеСообщенийИзОчередей() Экспорт
	Справочники.ВходящиеСообщения.ПрочитатьСообщенияИзОчереди();
КонецПроцедуры

Процедура ОбработкаПолученныхСообщений() Экспорт
	
	Справочники.ВходящиеСообщения.ОбработатьСообщения();
	
КонецПроцедуры
