#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьЗначенияРеквизитовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЗначенияРеквизитовФормы()
	
	Если Не Параметры.Ключ.Пустая() Тогда
		Статус = СтатусыДокументовВызовСервера.СтатусЗаказаНаСборку(Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СтатусПриИзмененииНаСервере(Ссылка, Статус)
	СтатусыДокументовВызовСервера.ОбновитьСтатусЗаказаНаСборку(Ссылка, Статус);	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере(Параметры.Ключ, Статус);
КонецПроцедуры

#КонецОбласти

