#Область Брокер

Процедура ЗагрузитьДокумент(ДанныеСообщения) Экспорт
	
	Реквизиты = ДанныеСообщения.Реквизиты;
	
	Ссылка = Документы.ЗаказНаСборку.ПолучитьСсылку(Новый УникальныйИдентификатор(Реквизиты.Идентификатор));
	
	ЗаказНаСборкуОбъект = Ссылка.ПолучитьОбъект();
		
	Если Не ЗаказНаСборкуОбъект = Неопределено Тогда
				
		ЗаказНаСборкуОбъект.Комментарий = Реквизиты.Комментарий;

		ЗаказНаСборкуОбъект.Записать();
		
	Иначе
		
		ЗаказНаСборкуОбъект = Документы.ЗаказНаСборку.СоздатьДокумент();
		ЗаказНаСборкуОбъект.УстановитьСсылкуНового(Ссылка);
		
		ЗаказНаСборкуОбъект.Дата = ТекущаяДата();
		ЗаказНаСборкуОбъект.Комментарий = Реквизиты.Комментарий;
	
		ЗаказНаСборкуОбъект.Записать();

		
	КонецЕсли;
		
КонецПроцедуры

Функция ВыгружаемыеРеквизиты() Экспорт

	Результат = Новый Массив();
	
	Результат.Добавить("Номер");
	Результат.Добавить("Дата");
	Результат.Добавить("Комментарий");
	
	Возврат Результат;	
	
КонецФункции

Функция ДанныеОбъектаКВыгрузке(Объект) Экспорт
	
	// Упрощено чтоб не изобредать КД или БитАдаптер
	
	ПолноеИмя = Объект.Метаданные().ПолноеИмя();
	ДанныеОбъекта = ОбменСообщениямиПодготовкаСообщенияСервер.ШаблонСообщенияДляПреобразованияОбъектаВJSON();
    ДанныеОбъекта.ПолноеИмяОбъектаМетаданных = ПолноеИмя;
	
	ВыгружаемыеРеквизиты = ВыгружаемыеРеквизиты();
	Реквизиты = Новый Структура();
	Для Каждого Реквизит Из ВыгружаемыеРеквизиты Цикл
		Реквизиты.Вставить(Реквизит);		
	КонецЦикла;
		
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаКВыгрузкеДанных(ВыгружаемыеРеквизиты);
		
		Запрос.УстановитьПараметр("Ссылка", Объект);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Реквизиты, ВыборкаДетальныеЗаписи);	
		КонецЕсли;
		
		Реквизиты.Вставить("Идентификатор", Объект.УникальныйИдентификатор());
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(Реквизиты, Объект);
		Реквизиты.Вставить("Идентификатор", Объект.Ссылка.УникальныйИдентификатор());
		
	КонецЕсли;
	
	ДанныеОбъекта.Реквизиты = Реквизиты;
	
	Возврат ДанныеОбъекта;	
	
КонецФункции

Функция ТекстЗапросаКВыгрузкеДанных(ВыгружаемыеРеквизиты)
	
	Текст = 
	"ВЫБРАТЬ
	|	%ВыбираемыеРеквизиты%
	|ИЗ
	|	Документ.ЗаказНаСборку КАК ЗаказНаСборку";
	
	ДополнениеЗапроса = "";
	ЭтоПервыйЭлемент = Истина;
	Для Каждого Реквизит Из ВыгружаемыеРеквизиты Цикл
		
		Если Не ЭтоПервыйЭлемент Тогда
			ДополнениеЗапроса = ДополнениеЗапроса + ",";	
		КонецЕсли;
		
		ДополнениеЗапроса = ДополнениеЗапроса + "ЗаказНаСборку." + Реквизит;
		ЭтоПервыйЭлемент = Ложь;

	КонецЦикла;
	
	Текст = СтрЗаменить(Текст, "%ВыбираемыеРеквизиты%", ДополнениеЗапроса);
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти